{"html":"<p>Homeschoolers, as they are called in today's culture, are interesting people.  I don't know if you have met many homeschool students or parents before, but if you have, you would probably agree that they are a very interesting pack.  But just how interesting are they?  Lets survey them.</p>\n<h2>Questions</h2>\n<p>When writing out the survey, the question that troubled me most was the question of questions.  Literally, my absolute tallest hurdle was deciding which questions to ask, and how to word those questions.  After much thought, and consultation with those wiser than me, I decided to ask the following questions:</p>\n<h3>Age and Gender</h3>\n<p>These are important questions, as they will be some of the ways in which we later sort the results.</p>\n<h3>Did your parents divorce?</h3>\n<p>Do these people answer the other questions differently?</p>\n<h3>Animals</h3>\n<p>Because the the amount and type of animals the person's family owns might have something to do with the rest of the results, I also asked these questions:</p>\n<blockquote>\n<p>What is the approximate number of pets or farm animals your family owns?</p>\n</blockquote>\n<blockquote>\n<p>What type of animals are they: farm animals, pets or both?</p>\n</blockquote>\n<h3>Memory Test</h3>\n<p>For this, I read out loud a list of 20 words.  Once I am finished, I'd ask the person, &quot;Would you like me to repeat the list?&quot;  I will repeat the list up to two times if they wish.</p>\n<p>Once I am done with reading, I wait for about 30 seconds, the amount of words they remember is their score.</p>\n<h3>Screen Time</h3>\n<p>This is not just phone screen time, it's movies, work on a computer, etc.  In other words, it is the amount of time the person is looking at a screen.</p>\n<p>Additionally this is split up into three subcategories.  Screen time at play, work, and school.</p>\n<h3>Homeschooled?</h3>\n<p>A very useful question to ask the parents that are homeschooling their children.  Were they homeschooled?</p>\n<h3>Eschatology</h3>\n<h3>Number of children wanted</h3>\n<p>Maybe this will turn out to be something important at analyzation time.  To make things easier for the questionee, we'll make it multiple choice.</p>\n<ul>\n<li>0</li>\n<li>1-2</li>\n<li>3-5</li>\n<li>6-10</li>\n<li>11+</li>\n</ul>\n<p>A common answer I got was, &quot;As many as the Lord gives me.&quot;  I put all of these down in the <code>11+</code> category because their statement is saying that they are fine with that amount.</p>\n<h3>Would you homeschool your own children?</h3>\n<p>Of course, for some of the parents, this will already be evident, but for some of the children this is a great question.</p>\n<h3>Do you want to be a 'stay at home' parent?</h3>\n<p>Well, that's not really the question I asked, but that is what I was really wanting.  To effectively homeschool a child, at least one of the parents will generally have to 'stay at home'.  Does this person want to be that parent, are they hoping that the other parent will want to stay at home, or are they not planning to homeschool their children after all?</p>\n<p>The question asked was, &quot;Do you, or do you hope to, work at home, or outside the home?&quot;</p>\n<h2>Idea testing</h2>\n<p>Going into the work of creating the survey, I had a lot of different ideas.  I'll show each of the important ones, and if my idea was correct or not.</p>\n<p>First of all, however lets get an idea of the ages of the people we are analyzing.</p>\n<p>TODO</p>\n<h3>Memory gets drastically worse as age increases.</h3>\n<p>That is what I thought, but it appears that in the age group I tested, that is not so.</p>\n<p>TODO</p>\n<p>So that idea is still completely <strong>UNSUPPORTED</strong>.</p>\n<p>Of course, when a person is much older than 54, the age of the oldest person in this data set, I would assume that memory decreases, but as far as the ages 6-54 go, memory is about even in this data set.</p>\n<h3>The people who want to homeschool their children generally want more children.</h3>\n<p>The average number of children wanted for folks who want to homeschool their children is <code>6-10</code>, with the MODE being <code>11+</code>.</p>\n<p>The average number of children wanted for folks who do not want to homeschool their children is <code>1-2</code>, with the MODE being <code>0</code>.</p>\n<p>So this idea is <strong>SUPPORTED</strong> by this dataset.</p>\n<p>These results did take me a bit by surprise, I was expecting a difference between the two modes, but the greatness of this difference was something wholly unexpected.</p>\n<h3>More screen time correlates to a lower memory score.</h3>\n<p>I am going to be testing this idea using four different methods.</p>\n<h4>Method 1</h4>\n<p>The average memory score of people with more than 1.5 hours of screen time at play compared to the average memory score of the rest of the people.</p>\n<p>7.2% is the average memory score of the folks with more than 1.5 hours of screen time, compared to 7.6%, which is the average memory score of everyone else.  That is a small enough difference to indicate that the amount more than 1.5 hours of screen time at play does not either increase or decrease memory retention.</p>\n<h4>Method 2</h4>\n<p>The average memory score of those with more than 4 hours of screen time compared to the average memory score of the rest of the people.</p>\n<p>TODO</p>\n<h4>Method 3</h4>\n<p>A linear graph representing memory scores over screen time at play.</p>\n<p>TODO</p>\n<h4>Method 4</h4>\n<p>A linear graph representing memory scores over total screen.</p>\n<p>TODO</p>\n<h4>Overall</h4>\n<p>TODO</p>\n<h3>People that have more animals are more likely to have more children.</h3>\n<p>TODO</p>\n<h2>Interesting finds</h2>\n<p>It appears that 16% of the people surveyed were homeschooled, but do not want to, or don't, homeschool their children.  This was rather a surprise to me, I was expecting a much smaller number.</p>\n<p>Here is the complete breakdown.</p>\n<p>TODO</p>\n<p>TODO: Eschatological views</p>\n<h2>Conclusion</h2>\n<p>TODO</p>\n","title":"Homeschool Survey","description":"I surveyed 31 homeschool parents and teachers.  Here's what I found.","date":"11/13/2020"}